import React from 'react'

const TermsOfService = () => {
  return (
    <div className='p-2'>
      <h2 className='font-bold'>제 1조 (목적)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          이 약관은 밥이슈(이하 '회사'라 한다)가 제공하는 인터넷 관련 서비스(이하 '서비스'라 한다)를
          이용함에 있어 회사와 이용자의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로
          합니다.
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 2조 (정의)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          "회사"란 재화 또는 용역(이하 "재화 등"이라 한다)을 이용자에게 제공하기 위하여 컴퓨터 등
          정보통신설비를 이용하여 재화를 거래할 수 있도록 설정한 가상의 영업장을 말합니다.
        </li>
        <li>
          "이용자"란 "회사"에 접속하여 이 약관에 따라 "회사"가 제공하는 서비스를 받는 회원 및
          비회원을 말합니다.
        </li>
        <li>
          "회원"이란 "회사"에 개인정보를 제공하여 회원등록을 한 자로, "회사"의 정보를 지속적으로
          제공받으며 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
        </li>
        <li>
          "비회원"이란 회원등록을 하지 않고 "회사"가 제공하는 서비스를 이용하는 자를 말합니다.
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 3조 (약관 등의 명시와 설명 및 개정)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          "회사"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 등을
          이용자가 쉽게 알 수 있도록 "회사"의 초기 서비스화면(전면)에 게시합니다.
        </li>
        <li>
          "회사"는 약관의 규제에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령을
          위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
        </li>
        <li>
          "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 "회사"의
          초기화면에 그 적용일자 7일 이전부터 공지합니다. 다만, 이용자에게 불리한 약관 내용의 개정의
          경우에는 최소 30일 이상의 사전 유예기간을 두고 공지합니다.
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 4조 (서비스의 제공 및 변경)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          "회사"는 다음과 같은 업무를 수행합니다.
          <ul>
            <li>재화 또는 용역에 대한 정보 제공 및 구매계약의 체결</li>
            <li>구매계약이 체결된 재화 또는 용역의 배송</li>
            <li>기타 "회사"가 정하는 업무</li>
          </ul>
        </li>
        <li>
          "회사"는 재화 등의 품절 또는 기술적 사양의 변경 등의 사유가 발생한 경우, 장차 체결되는
          계약에 의해 제공할 재화 또는 용역의 내용을 변경할 수 있습니다.
        </li>
        <li>
          "회사"는 이로 인하여 이용자가 입은 손해에 대하여 배상합니다. 다만, "회사"의 고의 또는
          과실이 없음을 입증한 경우에는 그러하지 아니합니다.
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 5조 (서비스의 중단)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          "회사"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한
          경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
        </li>
        <li>
          "회사"는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가
          입은 손해에 대하여 배상합니다. 다만, "회사"가 고의 또는 과실이 없음을 입증한 경우에는
          그러하지 아니합니다.
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 6조 (회원가입)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          이용자는 "회사"가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는
          의사표시를 함으로써 회원가입을 신청합니다.
        </li>
        <li>
          "회사"는 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한
          회원으로 등록합니다.
          <ul>
            <li>등록 내용에 허위, 기재누락, 오기가 있는 경우</li>
            <li>기타 회원으로 등록하는 것이 "회사"의 기술상 현저히 지장이 있다고 판단되는 경우</li>
          </ul>
        </li>
        <li>회원가입 계약의 성립 시기는 "회사"의 승낙이 회원에게 도달한 시점으로 합니다.</li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 7조 (회원 탈퇴 및 자격 상실 등)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          회원은 "회사"에 언제든지 탈퇴를 요청할 수 있으며 "회사"는 즉시 회원탈퇴를 처리합니다.
        </li>
        <li>
          회원이 다음 각 호의 사유에 해당하는 경우, "회사"는 회원자격을 제한 또는 정지시킬 수
          있습니다.
          <ul>
            <li>가입 신청 시에 허위 내용을 등록한 경우</li>
            <li>
              "회사"를 이용하여 구입한 재화 등의 대금, 기타 "회사" 이용에 관련하여 회원이 부담하는
              채무를 기일에 지급하지 않는 경우
            </li>
            <li>
              다른 사람의 "회사" 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는
              경우
            </li>
          </ul>
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 8조 (개인정보 보호)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          "회사"는 이용자의 개인정보 수집 시 서비스 제공을 위하여 필요한 범위에서 최소한의
          개인정보를 수집합니다.
        </li>
        <li>
          "회사"는 이용자의 개인정보를 수집 및 이용하는 때에는 당해 이용자에게 그 목적을 고지하고
          동의를 받습니다.
        </li>
        <li>
          "회사"는 수집된 개인정보를 목적 외의 용도로 이용할 수 없으며, 새로운 이용 목적이 발생한
          경우 또는 제3자에게 제공하는 경우에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다.
        </li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 9조 (계약의 성립)</h2>
      <ol className='list-inside list-decimal'>
        <li>
          "회사"는 이용자의 구매 신청에 대하여 다음 각 호에 해당하면 승낙하지 않을 수 있습니다.
          <ul>
            <li>신청 내용에 허위, 기재누락, 오기가 있는 경우</li>
            <li>
              기타 구매 신청을 승낙하는 것이 "쇼핑몰" 기술상 현저히 지장이 있다고 판단하는 경우
            </li>
          </ul>
        </li>
        <li>계약의 성립 시기는 "회사"의 승낙이 이용자에게 도달한 시점으로 합니다.</li>
      </ol>
      <hr className='my-2' />
      <h2 className='font-bold'>제 10조 (분쟁 해결)</h2>
      <ol className='list-inside list-decimal'>
        <li>"회사"는 이용자로부터 제출되는 불만사항 및 의견을 신속하게 처리합니다.</li>
        <li>
          "회사"와 이용자 간에 발생한 전자상거래 분쟁과 관련하여 소송이 제기될 경우, 관할 법원은
          "회사"의 본사 소재지 관할 법원으로 합니다.
        </li>
      </ol>
    </div>
  )
}

export default TermsOfService
